tests/load/websocket-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      rampTo: 200
      name: "Ramp up load"
    - duration: 180
      arrivalRate: 200
      name: "Sustained load"
  engines:
    websocket: {}
  processor: "./websocket-events.js"

scenarios:
  - name: "WebSocket connection and messaging"
    engine: "websocket"
    flow:
      - think: 1
      - function: "connect"
      - function: "sendAuth"
      - function: "subscribeToConversation"
      - loop:
          - function: "sendMessage"
          - think: 1
        count: 10
      - function: "close"